{
    "Episode Summary": [],
    "Recap": [
        "Adam & Liza's psychiatrist urged them to go out on a date. Liza picked the movies. JR and Jamie were also there with their dates. JR skipped out on his Harvard interview to be with his girl. Aidan was almost caught by Derek at the bus depot, but Maria distracted Derek while Kendall kissed a disguised Aidan to keep his face hidden. Aidan recognized the woman who shot him but didn't tell Kendall. They leave with Maria and the woman finds out about them leaving after showing a picture of Maria. Trey kissed Greenlee at the boathouse, freaking her out. He was very embarrassed; David yelled at him and comforted Greenlee. Greenlee threw herself at David and realized she needs more therapy. David asked Trey to help out with the kid Reggie (who held Anna at knifepoint the other day), so Trey went to Jack to ask him to help cut through the red tape. The doctor from David's clinic, Jenelle, stormed in to tell Jack that Reggie never made it to Juvenile Hall. Jack checked and found out he accidentally got sent to the regular prison, so he sent Trey to get him out, with Jenelle tagging along."
    ],
    "Recap Author": "Suzanne",
    "Show Title": "All My Children",
    "Transcript": [
        "[PREVIOUSLY_ON]",
        "Derek: Have you seen this man? He's wanted for murder, ma'am.",
        "Kendall: You see him?",
        "Maria: No.",
        "Kendall: Aidan -- Aidan, Aidan!",
        "David: I've been thinking about Reggie, and I have an idea -- since his public defender really isn't on top of his case that maybe my brother could handle it.",
        "Greenlee: What do you want from me?",
        "[SCENE_BREAK]",
        "Greenlee: Ugh!",
        "Trey: Oh, my God. Greenlee -- Greenlee, I'm so sorry.",
        "Trey: Idiot! God.",
        "David: I just saw Greenlee bolting out of here. What happened?",
        "Trey: I kissed her.",
        "[SCENE_BREAK]",
        "Jamie: I wasn't sure what you wanted, so I got everything.",
        "Joni: That's exactly what I want.",
        "Jamie: Good.",
        "Joni: Where is everyone? I thought there was going to be a bunch of kids here since there's no school today.",
        "Jamie: I don't know, I guess -- I told everybody.",
        "Joni: I told my parents I'd be with a group.",
        "Jamie: Well, we are, kind of. I mean, the place will fill up and, well, we won't be alone then.",
        "Joni: I guess you're right.",
        "Jamie: Yeah. I'm glad you came with me.",
        "Joni: Me, too. Even if it is a slasher movie.",
        "Laurie: Hey, guys.",
        "Jamie: What are you doing here?",
        "Laurie: J.R. left me a message to meet him here. Where is he?",
        "Jamie: What?",
        "[SCENE_BREAK]",
        "Adam: J.R., could I talk to you for just a moment?",
        "J.R.: Dad, I'm going to be late.",
        "Adam: I want to tell you that I'm happy that you're finally -- well, you're finally making an effort.",
        "J.R.: Oh.",
        "Adam: And I want to wish you the best.",
        "J.R.: Thanks.",
        "Adam: This alumni interview will go a long way to getting you accepted into Harvard, especially after three Fs and an incomplete in your last quarter.",
        "J.R.: Yeah, well, I told you I'd make them up.",
        "Adam: You can start by making up that Sociology paper. I want a rough draft by the end of the week.",
        "J.R.: Ok, Dad.",
        "Adam: It wasn't easy convincing that teacher to give you an extension, you know.",
        "J.R.: I know. Thank you.",
        "Adam: Yeah, you really want to thank me? How about putting something on that's a little more appropriate for an interview?",
        "J.R.: What, like a coat and tie? I'll look like a geek.",
        "Adam: There's nothing wrong with looking -- with a coat and a tie.",
        "J.R.: Well, I don't have time. Can I go now?",
        "Adam: Yeah, well, all right, I won't keep you, won't make you wait. It's just I'm just glad that you're finally excited about getting into Harvard.",
        "J.R.: Yeah.",
        "Adam: Not that it'll be easy. That's why I've hired a math tutor -- three times a week, starting Monday.",
        "J.R.: What? No. No, I got it all under control. I don't need a tutor. I got to go.",
        "Adam: Sorry I had to interrupt our session, ladies. I had to have a little discussion with J.R. All right, don't make me guess. Just enlighten me.",
        "Lysistrata: Well, maybe you can enlighten me. Is there anyone you don't need to control?",
        "[SCENE_BREAK]",
        "Woman: Sir? Your ticket?",
        "Aidan: Um, I think I forgot my --",
        "Maria: Aidan, are you all right?",
        "Kendall: Oh, thank God we got to you before the cops did.",
        "Aidan: What are you guys doing here?",
        "Kendall: Aidan, the police are looking for you.",
        "Aidan: Look, if I get on that bus, it ends. Let me go.",
        "Kendall: No, it's too late for that. You won't even make it as far your seat.",
        "Maria: You need our help.",
        "Aidan: Look, I'm sorry, no, I need to do this alone.",
        "Maria: That doesn't make sense.",
        "Derek: Maria?",
        "Maria: What is wrong --",
        "Derek: Is that you?",
        "Maria: Do I know you?",
        "Derek: Yes, I'm sorry. I'm Derek Frye.",
        "Maria: Oh, I'm sorry, I don't remember you, no.",
        "Derek: You don't remember me. I know, yeah. I followed your story in the paper.",
        "Maria: Ok.",
        "Derek: Yeah. I'm sorry, I don't mean to stare at you, but, well, it's just amazing to see you.",
        "Maria: I have been told, yeah.",
        "Derek: Yeah, no doubt, I'm sure. I understand that you prefer to be called Maureen now.",
        "Maria: Yeah, I'm more comfortable with that.",
        "Derek: Yeah.",
        "Maria: Definitely. So you're a cop? Look at that.",
        "Derek: Yeah, yeah, um --",
        "Maria: I hope I wasn't some hooligan or something when you knew me before.",
        "Derek: Oh, no, hardly.",
        "Maria: Are you here to meet somebody?",
        "Derek: No, I'm -- well, I'm heading up a joint task force with the feds.",
        "Maria: Oh, that's -- that's very impressive. That's serious, too. Actually, I was wondering how you guys catch the bad guys, because can you tell just by looking at them who's bad?",
        "Derek: Not very often, no.",
        "Maria: No? I mean, you know, say that guy right there. He looks kind of bad.",
        "Derek: Oh, yeah, he's bad.",
        "Maria: And the woman next to him in the hat is guilty as sin.",
        "[Derek laughs]",
        "Aidan: Oh, my God. That's a good-bye kiss? What, am I going to the moon?",
        "Kendall: No, no, no, there's a cop within cuffing distance. Don't turn around, don't turn around.",
        "Aidan: What's going on?",
        "Kendall: There's a cop within cuffing distance and -- no -- worse, I know him. I know him, ok? Don't ask.",
        "Aidan: Don't tell me there's a warrant out for your arrest.",
        "Kendall: No, no, no, he doesn't want anything to do with me. See, it's all about Maureen. I guess he's a blast from her past. Oh, why isn't she getting rid of him?",
        "Aidan: Well, where are they? Maybe I can make that person --",
        "Kendall: No, no, you're staying right here with me. You're not going anywhere. You're staying here with me.",
        "Aidan: Well, how long are we going to be tangled up here for?",
        "Kendall: Well, maybe all day, big boy. You got a problem with that?",
        "Aidan: Do I have a choice?",
        "Kendall: No, not while Lieutenant Frye is looking for his boss' nephew, the big, bad fugitive wanted for murder. Kiss me.",
        "[SCENE_BREAK]",
        "David: You kissed our brother's widow? Here? This is the place she comes to feel safe, to feel close to Leo! What were you thinking?",
        "Trey: I wasn't. It -- it just -- just happened.",
        "David: How?",
        "Trey: I don't know! Greenlee was on her rant, blaming me for Leo's death, and no matter what I said, she wouldn't listen. She just wouldn't let up. I didn't kill him. I didn't want him dead.",
        "David: I know that.",
        "Trey: But she doesn't! But no matter what I say, she doesn't listen, so",
        "David: So, what, you kissed her?",
        "Trey: God, what a colossal mistake! How could I be so stupid?",
        "David: Yeah, that's what I'd like to know.",
        "Trey: I didn't mean to kiss her. I never meant to do that. You believe me, don't you?",
        "David: No, the real question here, Trey, is this -- are you falling in love with Greenlee?",
        "[SCENE_BREAK]",
        "Adam: Wanting what's best for my son makes me a control freak?",
        "Lysistrata: I see how much you love J.R., but when you force him to do what you want --",
        "Adam: No, those were suggestions.",
        "Lysistrata: Ok, I have a suggestion.",
        "Adam: Oh, this ought to be good.",
        "Liza: Adam --",
        "Lysistrata: It's obvious how much you love your family, but you love with an iron grip. Your relationships with your wife and children would benefit from you allowing them more freedom. So I'd like you to try an experiment. When was the last time you two were on a date?",
        "Liza: Back when the earth was cooling.",
        "Adam: That's your answer? A date solves everything?",
        "Lysistrata: It could solve a lot if it teaches you that relinquishing control isn't so terrible. So I propose that each of you plans a date and the other simply goes along and has a good time.",
        "Liza: I think that sounds kind of wonderful. I'd like to plan the first date.",
        "Lysistrata: Any objections, Adam?",
        "Adam: No, absolutely none. Where would you like to go? How about the ballet? There's a Tito exhibit at the museum.",
        "Liza: Hmm, it's my date, and I have something completely different in mind.",
        "Adam: Ah.",
        "[SCENE_BREAK]",
        "Jamie: I told J.R. I was bringing Joni. It's not like this was a planned thing for all of us to --",
        "Laurie: Oh. I get it. We won't crash your date.",
        "Joni and Jamie: It's not a date.",
        "Laurie: Whatever. Me and J.R. will sit up front. You won't even know we're here.",
        "Joni: You don't have to sit so far away. I mean, there's plenty of room right here.",
        "J.R.: Sorry I'm late. Hey, James. Just pretend we're not here. You want any candy or something?",
        "Laurie: I've got everything I want right here.",
        "Jamie: Hello? Joni?",
        "Joni: How can they do that here, in front of God and everyone?",
        "Jamie: If you don't like it, don't watch.",
        "Joni: Kind of hard not to.",
        "Jamie: Let's do the movie quiz. It's starting.",
        "Joni: I'm bad at those. \"These two actresses tied for the most Oscar nominations.\" Who would know that?",
        "Jamie: Um -- Katharine Hepburn and Meryl Streep. 12 each.",
        "Joni: That's -- right. How did you know that?",
        "Jamie: My mom interviewed them.",
        "Joni: Both of them?",
        "Jamie: Yeah. So?",
        "Joni: So that's -- that's cool.",
        "Jamie: Like me.",
        "Joni: Yeah, like you. Showoff. Ok, \"unscramble 'elm bignos.'\"",
        "Jamie: \"Elm bignos.\" Mel Gibson. Oh, that's 2-2.",
        "Joni: You keep surprising me.",
        "Jamie: Good.",
        "Joni: It's getting kind of crowded. You want to maybe move closer to the screen?",
        "Jamie: The movie's going to be starting soon, and then it'll be just us.",
        "Joni: Want some?",
        "J.R.: So did you have any trouble getting out?",
        "Laurie: I just left. It's easier that way.",
        "J.R.: I know, the less you tell him, right?",
        "Laurie: I'm sorry it has to be this way.",
        "J.R.: Yeah, me, too. But I couldn't wait to see you.",
        "Laurie: Your interview for Harvard was today, wasn't it? I'm so proud of you. It didn't take very long. How'd it go?",
        "J.R.: Uh, I don't want to talk about it.",
        "Laurie: Your dad must be mega thrilled.",
        "J.R.: I don't want to talk about him either.",
        "Laurie: We don't have to talk at all.",
        "[SCENE_BREAK]",
        "Adam: Well, it's a little bit cold out to do anything really different. Maybe -- excuse me.",
        "Lysistrata: Oh, sorry.",
        "Adam: Maybe we could go down to the gatehouse, build a fire, have some dinner?",
        "Lysistrata: Did Liza ask you for your suggestions, Adam?",
        "Adam: No, but --",
        "Liza: Well, so it's my date and I'm going to plan it.",
        "Lysistrata: Good. Stick to that.",
        "Liza: Ok.",
        "Adam: I was trying to help.",
        "Lysistrata: You want to help? Be open-minded and let Liza do this her way. You'll get your chance when you plan the next outing.",
        "Adam: I was thinking of --",
        "Liza: What? Were you thinking about me? You weren't thinking about me. I want to do what I want to do, and I want to do something we've never done before. I want to do something fun. Can you handle that?",
        "Adam: When you want to pick me up?",
        "[SCENE_BREAK]",
        "Trey: Falling in love with Greenlee? No. No, of course not. Look, I care for her just like you do.",
        "David: I'm not putting moves on her.",
        "Trey: That wasn't a move. It was an accident.",
        "David: Oh, an accident? That's an interesting way to put it. You mean one waiting to happen?",
        "Trey: What's that supposed to mean?",
        "David: Greenlee said that you've been following her everywhere. Everywhere she goes, you go. Is that right?",
        "Trey: She -- she shouldn't be alone right now.",
        "David: Apparently not with you. I mean, you've been so concerned about being there for Greenlee. What were you doing? You just waiting for the opportunity, the chance to lay one on her?",
        "Trey: I want to help her. She's grieving.",
        "David: She's vulnerable Trey, and you just screwed that up! You took advantage of it!",
        "Trey: You know I didn't mean to do that. I loved Leo. I would never disrespect his widow.",
        "David: No, you did a lot worse than that. Greenlee doesn't trust anybody right now, especially us, and you just shattered any trust that she did have.",
        "Trey: I blew it. I blew it. I know that. I'm sorry. I'll apologize to her. I'll make her see that it was a mistake.",
        "David: No, no, you'd better wait till she cools down. Which isn't a bad idea for you, either.",
        "[Trey sighs]",
        "Trey: What a mess.",
        "David: Yeah. Look -- the reason why I even came down here was because I was looking for you. I have a favor I need to ask.",
        "Trey: What, pack my bags? Get out of town?",
        "David: Would you represent someone for free?",
        "Trey: Right now I'm full-time counsel at Fusion Cosmetics, but I could recommend someone.",
        "David: He's a kid, Trey. He's in a lot of trouble. He can't do it alone. He needs your help.",
        "[SCENE_BREAK]",
        "Aidan: Ok, tell me when it's clear, then I'll get out of here.",
        "Kendall: No, no, no way. You'll take off.",
        "Aidan: I won't. I'll meet you and Maureen at the car.",
        "Kendall: Whoa, all of a sudden you choose us over Seattle? No, I'm not falling for that, not from a flat-leaver.",
        "Aidan: A what?",
        "Kendall: There's no way I'm taking you out of my sight.",
        "Aidan: Look, I'll be better off on my own.",
        "Kendall: No, listen to me, listen to me, Aidan, the cops are looking for a suspicious-looking guy who is all by himself. Look, there is no way that they'll go after a guy who's crawling all over his girlfriend. You get it? Come on.",
        "Aidan: But there's got to be another way.",
        "Kendall: You think I'm doing this for fun? I'm trying to save your life, ok? Now, come on. Come on. Can you do any better than that? What? What is it? What, are you saving yourself for Maureen?",
        "Aidan: Kendall --",
        "Kendall: That's it. That's it. You know, I'm busting my butt over here trying to protect you --",
        "Aidan: Shh, shh, shh.",
        "Kendall: And you wish that I was the one talking to the cop and that Maureen was here kissing you.",
        "Aidan: I thought the idea was to remain inconspicuous.",
        "Kendall: Well, is it so freaking hard to kiss me? At least I can make it look good. People will believe that we were lovers. You haven't even slept with Maureen.",
        "Aidan: You talked about that?",
        "Kendall: Yeah, while we were changing a flat.",
        "Aidan: Maureen changed a tire?",
        "Kendall: Yeah, I helped. You want to see my finger? It hurts like hell, too, but I guess that doesn't matter to you, does it?",
        "Aidan: Look, Kendall, we are in the middle of a situation here, ok?",
        "Kendall: I see a cop coming. You trust me, right?",
        "Aidan: Oh, Kendall, why not.",
        "Kendall: Ok, then just follow my lead and make it look good.",
        "Maria: So who is the most wanted du jour?",
        "Derek: Have you seen this character?",
        "Maria: Who is he?",
        "Derek: Aidan Devane. But you already knew that, didn't you?",
        "[SCENE_BREAK]",
        "Trey: Well, I know what the system does to a kid, so, yeah. Yeah, of course. I'll do whatever I can.",
        "David: Good. I knew you'd understand. Thanks.",
        "Trey: I'll get right over to the D.A.'s office, see if I can meet with -- what was his name?",
        "David: Reggie.",
        "Trey: Reggie. Right, right.",
        "David: Yeah. Yeah, just stop by the clinic. Dr. Anderson will fill you in on the details.",
        "Trey: All right. I'm, uh, really sorry about what happened.",
        "David: I'm not the one that needs the apology, Trey.",
        "[footsteps]",
        "Greenlee: You're still here?",
        "Trey: Well, don't worry. I'm leaving.",
        "Greenlee: I forgot my purse.",
        "David: Trey told me what happened. I'm sorry.",
        "Greenlee: What, you want some, too, is that it, huh? Want to pick up where your new brother left off?",
        "[SCENE_BREAK]",
        "[movie plays]",
        "[scream]",
        "[screams]",
        "Liza: Oh, come on, please? The movie's already started. Let's go.",
        "Adam: What, that matters?",
        "Liza: Take a seat, please. Shh!",
        "Adam: Excuse me. Sorry. Thank you.",
        "Liza: You can stop being so dramatic.",
        "Adam: We could be home in our private screening room watching Harvey's unreleased movie right now.",
        "Liza: Yeah, well, you know what, we would miss all this atmosphere.",
        "[screams]",
        "Adam: I didn't know someone could make a sound like that.",
        "Liza: Oh, oh, here he comes, here he comes, here he comes.",
        "Adam: You brought me to a teenage horror flick.",
        "Liza: Yeah, yeah. Isn't it great?",
        "Adam: Great. Just great.",
        "Adam: That stuff is rancid.",
        "Liza: Adam --",
        "Adam: Oh, good grief. Liza, we have atmosphere at home, with climate control and real butter. What kind of derelicts come to a place like this?",
        "Man: You're here, aren't you?",
        "Adam: Stop eavesdropping.",
        "Woman: Stop talking.",
        "Liza: Please keep it down. The whole theater can hear you.",
        "Adam: For Pete's sake. I don't believe your idea of a romantic date is a slasher-movie.",
        "Liza: The movie isn't the point.",
        "Adam: Hmm.",
        "Liza: Do I need to show you what is?",
        "Adam: Oh. Oh. Well, ok. Then maybe -- maybe this isn't such a bad place after all. It's good for something, anyway. Oh, gum.",
        "Liza: Oh.",
        "Adam: Oh, good grief, that's it. Come on, we're leaving.",
        "Liza: No, no. Hold on. Just -- Adam, where's your sense of fun?",
        "Adam: It got stuck in the gum.",
        "Liza: Ok, now you're being a grouch. Would you just sit back? Relax. Just kiss me. And if you forgot how, look at -- look at those two.",
        "Adam: You expect me to get tips from a couple of teenagers groping each other in the dark?",
        "Liza: Are you telling me you're going to bail on me?",
        "Adam: Ahem. I don't know. Let me see your face.",
        "[Liza giggles]",
        "[SCENE_BREAK]",
        "Jack: Trey Kenyon. To what do I owe the rather dubious honor of this visit?",
        "Trey: It's about my client.",
        "Jack: Your client? That's right, I heard you're reinstated. Very industrious. Got yourself a client already, huh? Who is it?",
        "Trey: Reggie Porter.",
        "Jack: Reggie Porter? Well, son, I know you didn't grow a social conscience in your downtime, so why are you involved in this case?",
        "Trey: David asked me to represent him.",
        "Jack: Hayward asked you to defend the kid who tried to carve Anna up?",
        "Trey: Mm-hmm.",
        "Jack: What is this, a joke?",
        "Trey: No, no, not at all. Do you mind if I sit?",
        "Jack: Please do.",
        "Trey: Thank you. Apparently, Anna told Dr. Anderson that if we get the kid to cooperate, he'll get a break.",
        "Jack: I see. So Janelle Anderson is actually the person behind this, huh?",
        "Trey: You must know her.",
        "Jack: Yeah, I know her. I know her very well.",
        "Trey: Well, Janelle wants the kid --",
        "Jack: Look, Janelle is not this boy's court-appointed guardian, is she?",
        "Trey: No.",
        "Jack: No. So what Janelle wants isn't really relevant, is it?",
        "Trey: No --",
        "Jack: No.",
        "Trey: But it's also what Anna wants.",
        "Jack: Okey-doke. So what do you want?",
        "Trey: I'm going to need Reggie's case file and a letter from your office.",
        "Jack: Stating what, exactly?",
        "Trey: Well, I want immediate access to Reggie. A letter from you cuts through all the red tape.",
        "[footsteps]",
        "Janelle: Where is he?",
        "Jack: Dr. Anderson. Now my day is complete.",
        "Janelle: Look Jackson, Reggie is missing.",
        "Jack: Whoa, whoa, whoa, don't get excited. This is not your first barbecue, ok? Juvenile hall is a big place. Paperwork goes slowly.",
        "Janelle: He never made it to juvie. According to the cop at intake, there is no record of him being processed in.",
        "Jack: You're sure about this?",
        "Janelle: Of course I'm sure. I mean, is the matter with you people? Can't you keep track of one child? What kind of operation are you running here?",
        "[SCENE_BREAK]",
        "Maria: I beg your pardon?",
        "Derek: As I mentioned, I know your story. Mr. Devane helped you when you first came to Pine Valley and you didn't want to be found. And now he's on the run, and here you are at the one place that is his best bet for getting out of town. And on top of it all, you're pretending you don't even know him. Want to tell me why?",
        "Maria: You must think that I'm -- I'm pretty horrible.",
        "Derek: Confused maybe.",
        "Maria: Look, I'm sorry, ok? I'm sorry. I shouldn't have lied to you. It's just that, yes, I know Aidan is in a lot of trouble, and he was really wonderful to me when I had nowhere to turn.",
        "Derek: Are you helping him?",
        "Maria: I wouldn't even know where to start. I wouldn't even know how to do that. I'm just -- I'm worried about him.",
        "Derek: So you just came looking for him? Why'd you come to the bus station? Was it something he said?",
        "Maria: No. No, look, I just don't want him to be hurt.",
        "Derek: Well, if you really want to help him, help me find him. Because as long as he's out on the street, I can't guarantee his safety.",
        "Maria: I don't know anything. I wish I did.",
        "Derek: Well, it's really nice seeing you again, Maureen. But just so you know, I really don't like being played, not by anyone. Not even an old friend.",
        "Maria: Look, um, truce. I was just about to go and check the departure board and see if I recognized anyplace that Aidan might run to. Do you want to go with me?",
        "Derek: Yeah.",
        "Kendall: Finally. I thought she'd never get him off our scent.",
        "Aidan: They're gone?",
        "Kendall: Yeah, yeah. Let's go, let's go.",
        "Aidan: No, you go.",
        "Kendall: Aidan --",
        "Aidan: I need to --",
        "Kendall: No, no, no, if Derek gets a whiff of me, he'll know something's up for sure, so let's just go now.",
        "Aidan: Hold on, hold on a minute.",
        "Kendall: Are you kidding me? This is our chance to get back to the condo. We have to go. Let's get a move on now.",
        "Aidan: There is no way -- Kendall, there's no way I can go back there. Don't you understand? Ok, if you are close to me, you're a target, you and Maureen, and I will not let that happen. I need to get on that bus.",
        "Kendall: Aidan, what? Aidan, what? What is it?",
        "[SCENE_BREAK]",
        "Janelle: Quit wasting time and get one of your finest to find that child.",
        "Jack: You know what, I'll go you one better than that, Janelle -- I'll find him myself. You wait here.",
        "Janelle: That man, he just has to keep believing in this system. When is he going to realize that it hurts these kids more than it helps them?",
        "Trey: Hmm, I didn't realize you were so well acquainted with our D.A.",
        "Janelle: Yeah, we banged heads a lot -- too much. Don't get me wrong, he's a good man. He just doesn't understand what these kids need.",
        "Trey: And you do?",
        "Janelle: I try. Look, he thinks these kids are nothing but trouble. But, see, I know who draws cartoons for their little brother so they'll laugh, I know who sings like an angel, I know who wants to go to college.",
        "Trey: And what do you know about Reggie Porter?",
        "Janelle: I know that he tries. He tries harder than anyone I know. But his father is gone and his mother, she can't shake her addiction, and other than gang members, no one gives a damn about this kid.",
        "Trey: You do.",
        "Janelle: That's not enough. I mean, do you know how many Reggies there are out there? I mean, for every kid we help, there are dozens that fall through the crack.",
        "Trey: And you think that Reggie's worth saving?",
        "Janelle: Yeah. I mean, he struggles to keep out of the gang life, but he gets his family fed and gets to school every day.",
        "Trey: He endangered the life of a woman and her unborn child.",
        "Janelle: He panicked.",
        "Trey: It's a bad excuse.",
        "Janelle: It's no excuse, but I understand it. You know, what I don't understand is why Anna and David want to help him.",
        "Trey: Well, apparently you must have been very convincing.",
        "Janelle: It had nothing to do with me. And what's your story? What is Dr. Hayward holding over your head?",
        "Trey: David's my brother. He asked me. I'm not a fan of the system, either. I grew up in foster care. I know what it's like.",
        "Janelle: Well, then maybe Reggie has a chance.",
        "Trey: I'll do everything I can for this kid.",
        "[footsteps]",
        "Janelle: Jackson? What, did you find Reggie?",
        "[SCENE_BREAK]",
        "David: I don't want anything from you, Greenlee.",
        "Greenlee: Why not? Trey got some action.",
        "[Greenlee laughs]",
        "David: Greenlee, stop. Trey feels terrible.",
        "Greenlee: Oh, because he didn't score? What else did he say? That it was good? That I was hot?",
        "David: That he made a big mistake.",
        "Greenlee: Oh, he got that right.",
        "David: Trey crossed a line, no doubt about it. But, Greenlee, you have to understand he's grieving, too. And, yes, he overreacted big time.",
        "Greenlee: So, is it your turn to grieve now? Is that why you're here? You're no better than Trey. You both took advantage of Leo. I'm all that's left of him. Why not take advantage of me, too? Huh? Is this what you want, David? Huh? This make you feel better, make the pain go away?",
        "David: Stop it, stop it. Don't do this!",
        "Greenlee: It's what you want, isn't it, huh?",
        "David: No.",
        "Greenlee: To feel my pain?",
        "David: Stop it! What I want is for you to get the help that you need. And, yes, you're right, you're right, you are the only thing that we have left of Leo. But we don't want to lose that and we don't want to lose you. Look, I know you're angry right now, at us, at Leo, at the world. But, Greenlee, you got to know this isn't the way to deal with it.",
        "Greenlee: What am I doing?",
        "David: It's all right. It's all right.",
        "Greenlee: What's wrong with me?",
        "David: Look, you're -- you're overwhelmed, ok? You're trying to cope, and we want to help you with that. Greenlee, please, let us. We're on your side.",
        "Greenlee: You're right. I need help. But I'm not going to get it here. Leo's gone. He can't help me. And neither can you.",
        "David: Greenlee, wait, wait.",
        "[SCENE_BREAK]",
        "Kendall: Aidan? Aidan, what's going on? What has got you so freaked out?",
        "Aidan: What do you want?",
        "Woman: Hello, Aidan. Long time no see.",
        "[dog barks]",
        "[alarm]",
        "Kendall: Aidan, what is it? What is it, Aidan? What is it?",
        "Maria: Ok, Derek's around back. Let's get out of here now.",
        "Kendall: Took you long enough to get rid of him.",
        "Maria: Yeah, tell me about it. Derek knows that I'm friends with Aidan.",
        "Kendall: What?",
        "Maria: Yeah, I think I threw him off, though, so let's just get out of here before he comes back.",
        "Kendall: Well, it's too bad that Aidan won't budge.",
        "Maria: Why? You're kidding me.",
        "Kendall: I don't know.",
        "Maria: Aidan?",
        "Aidan: Let's move. Let's get back to the condo.",
        "[SCENE_BREAK]",
        "[movie plays]",
        "[scream]",
        "Adam: Their movies are all the same -- sex equals death.",
        "Liza: Stop being such a cynic. I mean, when was the last time you saw a movie like this?",
        "Adam: Saw, no, but asked to invest once.",
        "Liza: You didn't tell me that.",
        "Adam: I turned down the invitation out of loyalty, actually.",
        "Liza: To whom?",
        "Adam: To you and Colby --",
        "Liza: Oh --",
        "Adam: And the rest of the women of the world. These are terribly anti- feminist.",
        "Liza: Please, you are so full of it.",
        "Adam: Oh, Liza. My arm has a cramp in it.",
        "Liza: Here, give me that.",
        "Adam: Oh, ow.",
        "Liza: You'll be fine.",
        "Adam: Liza, I'll take you to La Mer if you'll just -- a bottle of Pomerol will make us forget this misery.",
        "Liza: Adam, you said you would do this.",
        "Adam: We'll duck into the jewelers on the way.",
        "Liza: No, this is my date, remember? I planned this date.",
        "Adam: Date? It's torture.",
        "[phone rings]",
        "Liza: Get your phone.",
        "Adam: Oh.",
        "Man: What is your problem?",
        "Adam: What's yours?",
        "Woman: Jerks like you.",
        "Jamie: Turn it off, already. Have some consideration.",
        "Liza: Honey, just --",
        "Adam: Why don't you just mind your own business?",
        "Liza: Honey, just --",
        "Jamie: Yeah, \"honey,\" why don't you shut your big, fat --",
        "[ring]",
        "Adam: Well, well. If it isn't young Jamie Martin.",
        "Jamie: Mr. Chandler.",
        "[SCENE_BREAK]",
        "Jack: I'm sorry to say it did turn out that Reggie's paperwork got screwed up.",
        "Janelle: We've established that.",
        "Trey: Where is he?",
        "Jack: Right now he's in the general population at Sykes Island Prison.",
        "Janelle: What? He's being treated as an adult?",
        "Jack: No, he's not --",
        "Janelle: He's 15 years old, Jackson!",
        "Jack: I realize that, Janelle.",
        "Janelle: Do you know what danger he's in? You know what can happen to him?",
        "Jack: Look, you can stand there and you can try to assign blame or you can let me try to fix this, ok? Now, here's what I propose -- Trey, I'm going to call the prison, tell them to expect you and extend all courtesies, ok? Find this kid, please. I'm very sorry this happened.",
        "Janelle: Yeah, well, if anything happens to him, I'm going to sue you, the city, the founding fathers.",
        "Jack: I've already got heads rolling, Janelle, don't worry about it.",
        "Trey: Dr. Anderson, I will find him.",
        "Janelle: No, I'm going with you.",
        "Trey: I don't think that's a very good idea.",
        "Janelle: Look, Reggie doesn't know you. He needs a face he can trust.",
        "Trey: All right. All right, all right, let's go.",
        "[SCENE_BREAK]",
        "[knock on door]",
        "Greenlee: Thanks for coming on such short notice.",
        "Lysistrata: I was surprised to get your message, Greenlee. Our next session isn't until Thursday. What happened?",
        "Greenlee: Lysistrata, I think -- I think I'm losing my mind.",
        "Lysistrata: Do you? Good.",
        "[SCENE_BREAK]",
        "Aidan: I changed my mind. Lying low is the answer. There's way too much heat.",
        "Maria: Ok, ok, then let's go.",
        "Kendall: Hold on, hold on. Suddenly, you're completely spooked, and it had nothing to do with the cops. What did you see?",
        "Maria: Aidan?",
        "Aidan: Look, I saw my future, always on the run. I don't want that. I want to take care of what's right in front of me.",
        "Kendall: Whatever.",
        "Aidan: Come on, let's move.",
        "Maria: Let's go.",
        "Woman: Excuse me, madam. Have you seen this woman?",
        "Second woman: Why, yes, I think I did.",
        "First woman: Where? When?",
        "Second woman: Well, right here. A couple of real lovebirds.",
        "First woman: Really? Well, did you see where they went?",
        "Second woman: Oh, they just left. They went that way.",
        "First woman: All right, thank you very much.",
        "Second woman: They were such lovebirds. That's why I -- noticed.",
        "[NEXT_ON]",
        "Maggie: Henry -- you forgot to take my number.",
        "Trey: You're going to the doctor -- got it? Even if I have to drag you to that clinic myself.",
        "Greenlee: You remember Trey? He kissed me.",
        "Lysistrata: Woo-hoo! It's about time."
    ],
    "Transcript Author": [
        "By Suzanne Proofread by Alicia"
    ]
}