{
    "Episode Summary": [],
    "Recap": [
        "Here's today's abbreviated recap folks! Ridge laments about Bridget leaving tonight, but realizes he is making a really big deal about the whole thing. Brooke understands that he and the kids are facing the post-Italy blues, but points out that Bridget probably wants to have her own life. To make things easier for the kids, Brooke has called up Catherine to come get the kids ready for bed and make their morning routine flow a little smoother tomorrow. She also has turned on the spa so Ridge can relax. After a kiss, they both go down to the spa, but Brooke doesn't plan on staying. She has to go home and take care of Hope. Ridge coyly asks Brooks for a kiss, but ends up pulling her into the spa so she and her dress are completely soaked. Horseplay ensues. CJ welcomes Bridget home with some flowers, but their visit it cut short when Mass stops by. CJ leaves and Mass and Bridget start an unpleasant conversation. He makes it clear that he disagrees with her decision to leave Ridge's house. Slowly, she begins to realize that Mass in insinuating that Bridget has more than sibling related feelings for Ridge and is completely floored at Mass' gall. She denies those feelings and also realizes he is really trying to get Brooke out of Ridge's life. Mass says that Brooke will be gone no matter what he does, because she lacks substance. Bridget kicks out Mass after he tells her to not sit on her feelings too long. Coming soon: will Mass get his way and get Bridget into Ridge's love life?"
    ],
    "Recap Author": "Matt",
    "Show Title": "Bold and the Beautiful",
    "Transcript": [
        "[Ridge sighs]",
        "Brooke: Here you go.",
        "Ridge: I should have offered her money.",
        "Brooke: What?",
        "Ridge: Bridget.",
        "Brooke: Oh.",
        "Ridge: God, I'm such an idiot! She's going to school, working so hard. I should have just offered her some money to help with the kids. She could have quit that stupid waitressing job and stayed here.",
        "Brooke: Well, she doesn't need money. And she likes that stupid waitressing job. I think she just needs her own life, you know? You had to know she was going to go home sooner or later.",
        "Ridge: Mm, yeah.",
        "Brooke: But don't worry. You're gonna have plenty of help around here with the kids.",
        "Ridge: It's not really that. It wasn't what she was doing for me. It was more, I just -- I miss having her around. She's a good kid.",
        "[SCENE_BREAK]",
        "[Knock on door]",
        "Bridget: Hey.",
        "C.J.: Hey. Welcome home.",
        "Bridget: Oh, thank you.",
        "C.J.: You're welcome.",
        "Bridget: They're beautiful.",
        "[C.J. Sighs]",
        "C.J.: Boy, I missed you.",
        "[Bridget laughs]",
        "Bridget: I missed you, too.",
        "C.J.: Long flight, huh?",
        "Bridget: Yes.",
        "C.J.: You must be pretty wiped out. Bridget that's an understatement.",
        "C.J.: Well, here, sit down. I'll make your tea for you.",
        "Bridget: Thank you.",
        "C.J.: I think I know where everything is. So are you home to stay?",
        "Bridget: Yeah.",
        "C.J.: Good. So -- tell me about your trip. How was Portofino?",
        "Bridget: It was great.",
        "C.J.: Just \"great\"? What, did you get a chance to do any sightseeing?",
        "Bridget: No. Not really. Actually, I spent most of my time with Ridge and the kids.",
        "C.J.: Oh. That's kind of a bummer.",
        "Bridget: No, no. It was nice. It was really nice. [Knock on door] Massimo?",
        "Massimo: Hello, Bridget. Excuse me. Could I have a word?",
        "C.J.: Uh -- well, I'll get out of here and let you two talk.",
        "Bridget: Okay.",
        "C.J.: I'm really glad you're home.",
        "Bridget: Thank you. Me, too.",
        "C.J.: Massimo.",
        "Bridget: Come on in. I was just making myself some tea. Did you want something?",
        "Massimo: No, no. No, thank you. So, you've done it, huh? Moved back in here, huh?",
        "Bridget: Yep.",
        "Massimo: That was a mistake.",
        "Bridget: Well, you sure call 'em like you see 'em, don't you? Makes more sense all the time why you and Stephanie get along so well.",
        "Massimo: So -- why'd you leave?",
        "Bridget: It was just time.",
        "Massimo: Ridge didn't think so. He wanted you to stay.",
        "Bridget: Yes. But he understands.",
        "Massimo: I doubt that. I doubt even you understand what happened over there.",
        "Bridget: \"What happened over there\"?",
        "Massimo: I mean, the way you connected with the family. You didn't expect that.",
        "Bridget: Well, Massimo -- anyone would have fallen in love with those kids. They're so wonderful. And they've been through so much, you know? It's really humbling, seeing them try to be so strong. And they're just little kids.",
        "Massimo: And Ridge?",
        "Bridget: Hmm?",
        "Massimo: Ridge? I mean, how do you think he's coping with this?",
        "Bridget: He's amazing. You know, God, I would have wanted to just crawl into a hole and stay there forever. And I'm sure he did -- I know he did. But he just kept going on, for the kids and for Taylor. It's just a superhuman effort.",
        "Massimo: See? Very few people know him the way you do.",
        "Bridget: Yeah. It's kind of funny. I grew up knowing Ridge, or thinking I did. I always looked up to him and admired him. I mean, he was -- he was Ridge. But I don' tthink I ever knew the strength that was there, underneath it all. I've never been so impressed with anyone. No wonder my Mother loves him so much.",
        "Massimo: Your Mother doesn't love him, Bridget. Not the way you do.",
        "[SCENE_BREAK]",
        "Brooke: I think there's more going on here.",
        "Ridge: What do you mean?",
        "Brooke: All this stress about Bridget going home?",
        "Ridge: Yeah, I guess it doesn't make much sense, does it? Like you said, everybody knew it was just gonna be temporary.",
        "Brooke: I think it has more to do with the post-Italy letdown. We were living in a fantasy world.",
        "Ridge: And now it's back to reality, right?",
        "Brooke: A reality without Taylor. And my guess is that she's the one you're probably missing tonight.",
        "Ridge: Yeah, maybe so.",
        "Brooke: Was the party a mistake?",
        "Ridge: No.",
        "Brooke: Are you sure?",
        "Ridge: No, absolutely. It was -- it was very sweet of you to do that.",
        "Brooke: Ridge, I just want to do whatever I can to make things easier for you. [Doorbell rings] speaking of which -- hi.",
        "Catherine: Hi. Sorry it took me so long.",
        "Brooke: No, no. Your timing is perfect.",
        "Catherine: Hi, Ridge.",
        "Ridge: Hey, Catherine.",
        "Brooke: Well, Thomas is in bed. He's reading. And the girls are just about finished with their baths.",
        "Catherine: Okay. Great. I'll go get everybody tucked in.",
        "Brooke: Okay, thanks.",
        "Ridge: You called her?",
        "Brooke: Well, I thought the kids would need some help getting back into the morning routine. I hope you don't mind.",
        "Ridge: No. Not at all. It was very thoughtful, thank you.",
        "Brooke: And I have another good idea. After you kiss the kids good-night, why don't you go down to the spa and just relax and unwind. Your shoulders are so tight.",
        "Ridge: Oh, man. I turned the spa off before we left on the trip.",
        "Brooke: Oh, that's okay. I turned it on a couple of hours ago.",
        "Ridge: Well, you do think of everything, don't you?",
        "Brooke: That's my specialty -- turning up the heat.",
        "Ridge: As I well know. Why don't I meet you down there? Why don't I meet you down there why don't I meet you down there real soon?",
        "[SCENE_BREAK]",
        "Bridget: Look, I am so tired right now, okay? I don't want to get into another argument about my Mother.",
        "Massimo: Neither do I.",
        "Bridget: Of course our feelings for Ridge are different. I see him as my brother.",
        "Massimo: You do? You told Stephanie that you felt as if you lost your brother.",
        "Bridget: Well, I know that I haven't -- not really.",
        "Massimo: Yes, sweetheart, you have. Ridge is not your brother. Ridge is my son. You're Eric's daughter. You're not related at all.",
        "Bridget: Well, Ridge doesn't know that.",
        "Massimo: But you do. Okay? So, that's what makes a difference about your feelings.",
        "Bridget: Well, of course it makes a difference. I told you. I am very uncomfortable keeping this secret from him.",
        "Massimo: And that discomfiture is the reason you moved out? Hmm?",
        "Bridget: No, no, no.",
        "Massimo: No. There's more to it than that, isn't there?",
        "Bridget: Okay, I don't know what you're trying to get at here. I told you, it was just time for me --",
        "Massimo: Time. Time. Right, that's what you said -- time. But you really didn't want to move out, did you? I mean, you didn't want to give up that closeness, that sense of family, the bond that was growing between you and Ridge. No. Bridget, I saw it. I saw the way he relies on you. And let me tell you something -- from the point of view of his Father, I was so happy to see that someone like you was in his life. There's no reason -- Bridget, there's no reason that should change.",
        "Bridget: Well, it won't. Just because I've moved out -- I mean, we can still be close. And you know what? Ridge really doesn't need a lot of hand holding right now. At least not from me.",
        "Massimo: No, no, you are wrong. You are so wrong! He needs you more than ever. And in your own way, you need him, too. And I have a feeling that you're beginning to realize that, and that's what frightens you.",
        "Bridget: What fright -- what are you talking about?",
        "Massimo: Yes, because that is the reason you left the house. You're afraid --",
        "Bridget: What? No, no --",
        "Massimo: -- Of your growing feelings for Ridge.",
        "[SCENE_BREAK]",
        "Ridge: What's with the clothes?",
        "Brooke: My suit's at home.",
        "Ridge: Got some spares in the cabana, you know?",
        "Brooke: Oh, it's okay. I'm not the one who needed this. You did.",
        "Ridge: Yeah, I sure did.",
        "Brooke: So, is there anything else I can do for you? Get your mind out of the gutter.",
        "Ridge: Shame on you, Logan. The thought never crossed my mind.",
        "Brooke: Really? Boy, you are depressed.",
        "[SCENE_BREAK]",
        "Bridget: You can't possibly be saying what I think you're saying.",
        "Massimo: What am I saying?",
        "Bridget: You think -- oh, my God! You think I'm interested in Ridge?",
        "Massimo: I know that you feel very deeply about him.",
        "Bridget: Of course I feel very deeply about him, like my brother, which is what he is!",
        "Massimo: Oh, you --",
        "Bridget: No, no, no, no. I don't care whether it's technically true or not. I will always think of him as my brother!",
        "Massimo: But you can't now. You said yourself when you talked to Stephanie --",
        "Bridget: Forget what I told Stephanie! You're completely twisting my words! Believe me, Massimo, it never, ever crossed my mind, okay?",
        "Massimo: I believe you, Bridget. I do believe you. But on a certain level of consciousness ---",
        "Bridget: No, no, not on any -- any level! God! This is -- this is disgusting!",
        "Massimo: What? What? What?",
        "Bridget: What?! What?",
        "Massimo: Yes.",
        "Bridget: You want me to explain to you what's disgusting about this?",
        "Massimo: Uh-huh.",
        "Bridget: No, you know what? I can't even -- I can't even look at you right now. I want you to leave. I want you to leave now! Get out!",
        "[SCENE_BREAK]",
        "Ridge: Oh, yeah. Oh, yeah. Oh!",
        "Brooke: You feel better now?",
        "Ridge: Yeah.",
        "Brooke: Good. Then my work here is done.",
        "Ridge: Whoa, whoa. Wait, wait. Where are you going?",
        "Brooke: Gotta go home to my little girl. There's more people in this world who need me, you know?",
        "Ridge: What is it with you Logan women? The moment I get used to having you around, you abandon me, huh? What is that?",
        "Brooke: Oh, poor Ridge.",
        "Ridge: Twice in one night. Man, I don't know if I can take the rejection. This is such a blow to my ego, I'll tell you.",
        "Brooke: From monumental all the way to colossal? I'll be back.",
        "Ridge: When?",
        "Brooke: Soon and often. You won't even miss me. I'll be back before you know it.",
        "Ridge: I already miss you.",
        "Brooke: Good night.",
        "Ridge: One kiss? Oh, very cute. That's very cute.",
        "Brooke: Safer that way.",
        "Ridge: Since when have you ever resorted to being safe about anything, Logan? Get over here. Come here.",
        "Brooke: Ridge, I really can't stay.",
        "Ridge: One kiss! Just one kiss. Come here.",
        "Brooke: Just one kiss? Are you sure about this?",
        "Ridge: Well, if you beg me, I might give in.",
        "Brooke: Oh, yes. Your poor, battered ego. Ridge, you're gonna get me wet.",
        "Ridge: You're going in.",
        "Brooke: No. What are you doing, Ridge? No! Oh! I can't believe that! What are you --",
        "Ridge: One kiss. One kiss, that's what I said. You're free to go now.",
        "Brooke: Oh! You! Get away from me!",
        "Ridge: You can go now.",
        "[SCENE_BREAK]",
        "Massimo: Bridget, why are you so upset?",
        "Bridget: What you are accusing me of here?",
        "Massimo: Accusing? There's no crime here. Bridget, you have nothing to be ashamed of.",
        "Bridget: No, I have nothing to be ashamed of, but you do!",
        "Massimo: Why? Because you're an exceptional person? You're kind. You're caring. You're --",
        "Bridget: This isn't even about me! This is about my Mother.",
        "Massimo: No!",
        "Bridget: You are so desperate to get her out of Ridge's life that you're gonna just turn it --",
        "Massimo: She will be out of his life! Not because of anything I want. Not because of anything that you want. Because she doesn't have the substance, the integrity. She can't hold onto him! And the only reason that Ridge clings to her is out of habit, loneliness. She can't sustain the man. She doesn't even know who he really is. To Brooke, Ridge represents glamour and fun and -- but you -- see, you -- you see past beyond all that crap. You know who the man is. You know what's under there. Okay? You believe in his principles, his values, his children. You love his children --",
        "Bridget: Enough! Enough! I am not going to listen to one more word of this.",
        "Massimo: What are you afraid of? You're both special people.",
        "Bridget: Not one more word!",
        "Massimo: Okay. Think about what I just told you, Bridget. But don't take too long.",
        "[SCENE_BREAK]",
        "Announcer: Coming soon --",
        "Bridget: What do you want from me?!",
        "Announcer: Will the master manipulator get his way?",
        "Massimo: You're exactly the kind of woman that Ridge should have around him. On \"the Bold and the Beautiful.\" Get it on"
    ],
    "Transcript Author": [
        "By Suzanne proofread by Suvi"
    ]
}